#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # google_compute_instance_group_manager.web will be updated in-place
  ~ resource "google_compute_instance_group_manager" "web" {
        base_instance_name = "web"
        fingerprint        = "EUmVCVx7q6Y="
        id                 = "projects/gcp-first-project-268107/zones/asia-northeast1-a/instanceGroupManagers/web-mig"
        instance_group     = "https://www.googleapis.com/compute/v1/projects/gcp-first-project-268107/zones/asia-northeast1-a/instanceGroups/web-mig"
        name               = "web-mig"
        project            = "gcp-first-project-268107"
        self_link          = "https://www.googleapis.com/compute/v1/projects/gcp-first-project-268107/zones/asia-northeast1-a/instanceGroupManagers/web-mig"
        target_pools       = []
      ~ target_size        = 0 -> 2
        wait_for_instances = false
        zone               = "asia-northeast1-a"

        auto_healing_policies {
            health_check      = "https://www.googleapis.com/compute/beta/projects/gcp-first-project-268107/global/healthChecks/autohealing-health-check"
            initial_delay_sec = 120
        }

        named_port {
            name = "http"
            port = 80
        }

        update_policy {
            max_surge_fixed         = 1
            max_surge_percent       = 0
            max_unavailable_fixed   = 1
            max_unavailable_percent = 0
            min_ready_sec           = 0
            minimal_action          = "REPLACE"
            type                    = "PROACTIVE"
        }

      ~ version {
          ~ instance_template = "https://www.googleapis.com/compute/v1/projects/gcp-first-project-268107/global/instanceTemplates/gcp-first-project-web-202002191500" -> (known after apply)
        }
    }

  # google_compute_instance_template.web must be replaced
+/- resource "google_compute_instance_template" "web" {
        can_ip_forward          = false
      ~ id                      = "projects/gcp-first-project-268107/global/instanceTemplates/gcp-first-project-web-202002191500" -> (known after apply)
        labels                  = {
            "role" = "web"
        }
        machine_type            = "f1-micro"
        metadata                = {
            "enable-oslogin" = "TRUE"
            "role"           = "web"
        }
      ~ metadata_fingerprint    = "E1IVl_ocyQ4=" -> (known after apply)
        metadata_startup_script = <<~EOT
            #! /bin/bash
            apt-get update
            apt-get install -y apache2 mysql-client
            service apache2 enable
            INSTANCE_NAME=`curl -s -H "Metadata-Flavor: Google" http://metadata.google.internal/computeMetadata/v1/instance/hostname`
            ZONE=`curl -s -H "Metadata-Flavor: Google" http://metadata.google.internal/computeMetadata/v1/instance/zone`
            echo '<!doctype html><html><body><h1>Instance name: '$INSTANCE_NAME'</h1><h1>Zone: '$ZONE'</h1></body></html>' | tee /var/www/html/index.html
            echo "healthy" > /var/www/html/healthcheck.txt
        EOT
      ~ name                    = "gcp-first-project-web-202002191500" -> "gcp-first-project-web-202002211800" # forces replacement
      + name_prefix             = (known after apply)
      ~ project                 = "gcp-first-project-268107" -> (known after apply)
      ~ region                  = "asia-northeast1" -> (known after apply)
      ~ self_link               = "https://www.googleapis.com/compute/beta/projects/gcp-first-project-268107/global/instanceTemplates/gcp-first-project-web-202002191500" -> (known after apply)
        tags                    = [
            "healthcheck-http",
            "iap-ssh",
        ]
      + tags_fingerprint        = (known after apply)

      ~ disk {
            auto_delete  = true
            boot         = true
          ~ device_name  = "persistent-disk-0" -> (known after apply)
          - disk_size_gb = 0 -> null
          ~ disk_type    = "pd-standard" -> (known after apply)
          ~ interface    = "SCSI" -> (known after apply)
          - labels       = {} -> null
          ~ mode         = "READ_WRITE" -> (known after apply)
          ~ source_image = "projects/ubuntu-os-cloud/global/images/ubuntu-1804-bionic-v20200129a" -> "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-1804-bionic-v20200129a"
          ~ type         = "PERSISTENT" -> (known after apply)
        }

      ~ network_interface {
          ~ network            = "https://www.googleapis.com/compute/v1/projects/gcp-first-project-268107/global/networks/gcp-first-project-vpc" -> (known after apply)
            subnetwork         = "https://www.googleapis.com/compute/v1/projects/gcp-first-project-268107/regions/asia-northeast1/subnetworks/gcp-first-project-asia-northeast1-subnet"
          ~ subnetwork_project = "gcp-first-project-268107" -> (known after apply)
        }

      ~ scheduling {
            automatic_restart   = true
            on_host_maintenance = "MIGRATE"
          ~ preemptible         = false -> true # forces replacement
        }

      ~ service_account {
          ~ email  = "default" -> (known after apply)
            scopes = [
                "https://www.googleapis.com/auth/cloud-platform",
            ]
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Warning: Interpolation-only expressions are deprecated

  on instance.tf line 27, in resource "google_compute_instance_template" "web":
  27:     subnetwork = "${google_compute_subnetwork.first_subnet.self_link}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and 2 more similar warnings elsewhere)

```

</details>

*Workflow: `Terraform GitHub Actions`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
